app/controllers/members_controller.rb

	def create
		@member = Member.new(params.require(:member).permit(:name, :website))

		@member.save


  		#add mock interests for now
 		@interests_name = ['chocolate', 'netflix', 'computers']
 		@interests_name.each { |i_name|
  			@interest = Interest.create(:name => i_name, :member => @member)
---
INSERT INTO "members" ("name", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dsfgsssss"], ["website", "ssssssgdsf"], ["created_at", "2018-05-26 23:50:43.866794"], ["updated_at", "2018-05-26 23:50:43.866794"]]
INSERT INTO "interests" ("member_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["member_id", 13], ["name", "chocolate"], ["created_at", "2018-05-26 21:33:33.254331"], ["updated_at", "2018-05-26 21:33:33.254331"]]

	def show
    	@member = Member.find(params[:id])

    	@interests = Interest.where(:member_id => @member.id).all
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "interests".* FROM "interests" WHERE "interests"."member_id" = ? LIMIT ?  [["member_id", 7], ["LIMIT", 1]]

	def update
	  @member = Member.find(params[:id])
	  @f = params['member']['id']

	  @friend = Member.find(params['member']['id'])
	  @friendship = Friendship.new
	  @friendship.member1 = @member
	  @friendship.member2 = @friend

	  if @friendship.save
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "friendships" ("member1_id", "member2_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["member1_id", 13], ["member2_id", 10], ["created_at", "2018-05-28 01:16:00.299248"], ["updated_at", "2018-05-28 01:16:00.299248"]]