app/views/members/edit.html.erb

SELECT "members".* FROM "members"
---
    <%= form.label :member %>
    <%= form.collection_select(:id, Member.all, :id, :name) %>