app/views/members/index.html.erb

    <%= form.label :first_member %>
    <%= select("name", "member_id", Member.all.collect {|p| [ p.name, p.id ] }, {prompt: 'Select member'}) %>
---
SELECT "members".* FROM "members"

    <%= form.label :second_member %>
    <%= select("name", "member_id", Member.all.collect {|p| [ p.name, p.id ] }, {prompt: 'Select member'}) %>
---
SELECT "members".* FROM "members"